       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBLEM-3.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       END PROGRAM PROBLEM-3.
